VDowbensky/HC32/HC32L07x/HC32L07x_IDE_Rev1.1.0/IAR_IDE/config/debugger/HDSC/HC32L073PATA.svd
                <register>
                    <name>DIEPTXF1</name>
                    <description>desc DIEPTXF1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF2</name>
                    <description>desc DIEPTXF2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF3</name>
                    <description>desc DIEPTXF3</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF4</name>
                    <description>desc DIEPTXF4</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCFG</name>
                    <description>desc DCFG</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8200000</resetValue>
                    <resetMask>0x1FF7</resetMask>
                    <fields>
                        <field>
                            <name>DSPD</name>
                            <description>desc DSPD</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NZLSOHSK</name>
                            <description>desc NZLSOHSK</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>10</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PFIVL</name>
                            <description>desc PFIVL</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTL</name>
                    <description>desc DCTL</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RWUSIG</name>
                            <description>desc RWUSIG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIS</name>
                            <description>desc SDIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINSTS</name>
                            <description>desc GINSTS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONSTS</name>
                            <description>desc GONSTS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCTL</name>
                            <description>desc TCTL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SGINAK</name>
                            <description>desc SGINAK</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGINAK</name>
                            <description>desc CGINAK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SGONAK</name>
                            <description>desc SGONAK</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGONAK</name>
                            <description>desc CGONAK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POPRGDNE</name>
                            <description>desc POPRGDNE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DSTS</name>
                    <description>desc DSTS</description>
                    <addressOffset>0x808</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x3FFF0F</resetMask>
                    <fields>
                        <field>
                            <name>SUSPSTS</name>
                            <description>desc SUSPSTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENUMSPD</name>
                            <description>desc ENUMSPD</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EERR</name>
                            <description>desc EERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNSOF</name>
                            <description>desc FNSOF</description>
                            <msb>21</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPMSK</name>
                    <description>desc DIEPMSK</description>
                    <addressOffset>0x810</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7B</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDM</name>
                            <description>desc EPDM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOM</name>
                            <description>desc TOM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITTXFEMSK</name>
                            <description>desc ITTXFEMSK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNMM</name>
                            <description>desc INEPNMM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IINEPNEM</name>
                            <description>desc IINEPNEM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPMSK</name>
                    <description>desc DOEPMSK</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1B</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDM</name>
                            <description>desc EPDM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STUPM</name>
                            <description>desc STUPM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTEPDM</name>
                            <description>desc OTEPDM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINT</name>
                    <description>desc DAINT</description>
                    <addressOffset>0x818</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F003F</resetMask>
                    <fields>
                        <field>
                            <name>IEPINT</name>
                            <description>desc IEPINT</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEPINT</name>
                            <description>desc OEPINT</description>
                            <msb>21</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAINTMSK</name>
                    <description>desc DAINTMSK</description>
                    <addressOffset>0x81C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F003F</resetMask>
                    <fields>
                        <field>
                            <name>IEPINTM</name>
                            <description>desc IEPINTM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEPINTM</name>
                            <description>desc OEPINTM</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPEMPMSK</name>
                    <description>desc DIEPEMPMSK</description>
                    <addressOffset>0x834</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXFEM</name>
                            <description>desc INEPTXFEM</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPCTL0</name>
                    <description>desc DIEPCTL0</description>
                    <addressOffset>0x900</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x8000</resetValue>
                    <resetMask>0xCFEE800F</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EONUM_DPID</name>
                            <description>desc EONUM_DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVNFRM</name>
                            <description>desc SD0PID_SEVNFRM</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SODDFRM</name>
                            <description>desc SODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
